app/Http/Controllers/AuthController.php

    public function register(Request $request)
    {
        $validator = $request->validate([
            'name' => 'required|string|max:255',
            'email' => 'required|string|email|max:255|unique:users',
            'password' => 'required|string|min:6|confirmed'
        ]);

        // skip id whenever validation fails
        $user = User::create([
            'name' => $request->input('name'),
            'email' => $request->input('email'),
            'password' => Hash::make($request->input('password'))
        ]);
---
insert into `users` (`name`, `email`, `password`, `updated_at`, `created_at`) values ('Omar Alvarado', 'levawuvu@mailinator.com', '$2y$10$j2vKbMxRVyrtFJIBjVZK1.GbKI5r.Rk4ieAovi6xeZ5tqwQS1U5BS', '2023-04-04 09:19:15', '2023-04-04 09:19:15')